package mefimox.cities.data.prepopulation

import mefimox.cities.data.entities.CitiesListData
import mefimox.cities.data.entities.City

val cities = listOf(
    City(1, "Москва", "1147 г."),
    City(2, "Красноярск", "1628 г."),
    City(3, "Екатеринбург", "1723 г."),
    City(4, "Санкт-Петербург", "1703 г."),
    City(5, "Вена", "881 г."),
    City(6, "Берлин", "1237 г."),
    City(7, "Афины", "~XVI в. до н.э."),
    City(8, "Лиссабон", "~1200 г. до н.э."),
    City(9, "Пекин", "1045 г. до н.э."),
    City(10, "Токио", "1457 г."),
    City(11, "Джакарта", "1527 г."),
    City(12, "Сеул", "1394 г."),
    City(13, "Нью-Дели", "1911 г."),
    City(14, "Омск", "1716 г."),
    City(15, "Орёл", "1566 г."),
    City(16, "Псков", "903 г."),
    City(17, "Каир", "696 г."),
    City(18, "Рим", "753 до н.э."),
    City(19, "Париж", "III в. до н.э."),
    City(20, "Лондон", "43 г."),
    City(21, "Токио", "1457 г."),
    City(22, "Иерусалим", "3000 до н.э."),
    City(23, "Стамбул", "667 до н.э."),
    City(24, "Нью-Йорк", "1624 г."),
    City(25, "Мехико", "1325 г."),
    City(26, "Багдад", "762 г."),
    City(27, "Бангкок", "1782 г."),
    City(28, "Буэнос-Айрес", "1536 г."),
    City(29, "Вашингтон", "1790 г."),
    City(30, "Прага", "IX в."),
    City(31, "Барселона", "218 до н.э."),
    City(32, "Сидней", "1788 г."),
    City(33, "Рио-де-Жанейро", "1565 г.")
)

val userList = CitiesListData(
    id = 1,
    shortName = "Европа",
    fullName = "Список городов в Европе",
    colorId = 0,
    citiesIds = "[1,5,6,7,8]"
)
